In [1]:
import pandas as pd

In [2]:
from sklearn.tree import DecisionTreeClassifier

In [3]:
data = pd.read_csv('titanic.csv')

In [5]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

In [84]:
data_cleaned = data.dropna(subset=['Pclass', 'Fare', 'Age', 'Survived', 'Sex'])

In [85]:
data_cleaned.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4,1,1,PP 9549,16.7000,G6,S

In [86]:
data_learn = data_cleaned[['Pclass', 'Fare', 'Age', 'Sex']]

In [87]:
data_learn.head()

   Pclass     Fare  Age     Sex
0       3   7.2500   22    male
1       1  71.2833   38  female
2       3   7.9250   26  female
3       1  53.1000   35  female
4       3   8.0500   35    male

In [88]:
data_learn = data_learn.replace({'Sex' : {'female' : 0, 'male' : 1}})

In [89]:
data_learn.head()

   Pclass     Fare  Age  Sex
0       3   7.2500   22    1
1       1  71.2833   38    0
2       3   7.9250   26    0
3       1  53.1000   35    0
4       3   8.0500   35    1

In [90]:
X = data_learn.as_matrix()

In [91]:
Y = data_cleaned['Survived'].as_matrix()

In [92]:
# Learning the tree

In [93]:
clf = DecisionTreeClassifier(random_state = 241)

In [94]:
clf = clf.fit(X, Y)

In [95]:
importances = clf.feature_importances_ * 100

In [96]:
importances

array([ 14.00052185,  30.34364695,  25.6046101 ,  30.0512211 ])

In [99]:
clf.predict([[1, 20, 0, 1]])

array([1])